trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/Forms/ФормаИзмененияПричины/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДокументБлокировки") Тогда
		
		 ДокументБлокировки = Параметры.ДокументБлокировки;
		 ТекущаяПричинаБлокировки = ДокументБлокировки.ПричинаБлокировки;
		 
		 ТЗ = Новый ТаблицаЗначений;
		 ТЗ = ДокументБлокировки.Товары.Выгрузить();
		 
		 ТЗ.Колонки.Добавить("ТекущаяПричина");
		 ТЗ.ЗаполнитьЗначения(ТекущаяПричинаБлокировки,"ТекущаяПричина");
		 
		 Товары.Загрузить(ТЗ);
		 
	 Иначе
		 
		 Отказ = Истина;
		 
	 КонецЕсли;
	 
	Если РольДоступна("МенеджерТорговогоЗала") Тогда
		ПараметрыВыбораМенеджера = Новый Массив;
		ПараметрыВыбораМенеджера.Добавить(Новый ПараметрВыбора("Отбор.ДоступностьДляМенеджераТорговогоЗала", Истина));
		Элементы.ПричинаБлокировки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМенеджера);	
	КонецЕсли;	 
	 
КонецПроцедуры

&НаСервере
Процедура ИзменитьПричинуНаСервере()
	       
	ДатаДокумента = ТекущаяДата();
	
	ТЗ = Новый ТаблицаЗначений;	
	Структура = Новый Структура ("Выбрать",Истина);                       
    ТЗ = Товары.Выгрузить(Структура,"Номенклатура,Характеристика,Упаковка,Количество,КоличествоУпаковок");
	
	Если ТЗ.Количество() > 0 Тогда
		
		ДокументОбъект = ДокументБлокировки.ПолучитьОбъект();
		Запрос = ДокументОбъект.ПолучитьКоличествоДляРазблокировки(ДокументБлокировки.Ссылка);
		МассивРезультатов   = Запрос.ВыполнитьПакет();
		ТоварыДляРазблокировки = МассивРезультатов[МассивРезультатов.Количество() - 1].Выгрузить();
		
		Для Каждого Строка Из ТЗ Цикл
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
			СтруктураПоиска.Вставить("Упаковка", Строка.Упаковка);
			НайденныйТоварДляРазблокировки = ТоварыДляРазблокировки.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныйТоварДляРазблокировки.Количество() > 0 Тогда
				
				Если Строка.КоличествоУпаковок < НайденныйТоварДляРазблокировки[0].ИтогоКоличество Тогда
					 НайденныйТоварДляРазблокировки[0].ИтогоКоличество = НайденныйТоварДляРазблокировки[0].ИтогоКоличество - Строка.КоличествоУпаковок;
				 ИначеЕсли Строка.КоличествоУпаковок > НайденныйТоварДляРазблокировки[0].ИтогоКоличество Тогда
					 Строка.КоличествоУпаковок = НайденныйТоварДляРазблокировки[0].ИтогоКоличество;
				КонецЕсли;
				 
			Иначе
    			Сообщить("Разблокировать товар: " + Строка.Номенклатура + " в количестве " + Строка.КоличествоУпаковок + " невозможно. Уже разблокирован.");
				Возврат;
			КонецЕсли
			
		КонецЦикла;		
		
		
	
		НачатьТранзакцию();

		Попытка
			//Разблокировка
			ДокументРазблокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
			ДокументРазблокировки.Дата = ДатаДокумента;
			ДокументРазблокировки.Склад = ДокументБлокировки.Склад;
			ДокументРазблокировки.ДокументОснование =  ДокументБлокировки.ДокументОснование;
			ДокументРазблокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано;
			ДокументРазблокировки.БлокировкаОснование = ДокументБлокировки;
			ДокументРазблокировки.ПричинаБлокировки = ТекущаяПричинаБлокировки;
			ДокументРазблокировки.Ответственный = Пользователи.ТекущийПользователь();
			ДокументРазблокировки.Товары.Загрузить(ТЗ);
			ДокументРазблокировки.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ДокументРазблокировки.Ссылка, "Создан документ: "+ДокументРазблокировки.Ссылка);
			
			//Блокировка
			ДокументБлокировкиДвижения = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
			ДокументБлокировкиДвижения.Дата = ДатаДокумента+1;
			ДокументБлокировкиДвижения.Склад = ДокументБлокировки.Склад;
			ДокументБлокировкиДвижения.ДокументОснование =  ДокументБлокировки.ДокументОснование;
			ДокументБлокировкиДвижения.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
			ДокументБлокировкиДвижения.БлокировкаОснование = ДокументБлокировки;
			ДокументБлокировкиДвижения.ПричинаБлокировки = ПричинаБлокировки;
			ДокументБлокировкиДвижения.Ответственный = Пользователи.ТекущийПользователь();
			ДокументБлокировкиДвижения.Товары.Загрузить(ТЗ);
			ДокументБлокировкиДвижения.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировкиДвижения.Ссылка, "Создан документ: "+ДокументБлокировкиДвижения.Ссылка);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			Сообщить("Не удалось создать документы блокировки!");
			Сообщить(ИнформацияОбОшибке().Описание);

		КонецПопытки;

	Иначе
		Сообщить("Не выбраны товары для разблокировки");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПричину(Команда)

	если ЗначениеЗаполнено(ПричинаБлокировки)=Ложь тогда
		сообщить("Необходимо выбрать причину блокировки");
		возврат;
	конецесли;
	ИзменитьПричинуНаСервере();
КонецПроцедуры
